<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"aabea6ae98ce8bf3a90e9f4253e8d8c4a1d38f542cec895f215f7b9e63b5d8e4","plan_job_ref":"Job Plan Airflow DAGs #244 at https://github.com/cal-itp/data-infra/actions/runs/16209349608","plan_out_hash":"2fac1b2da376930b43c8a8a0e4738797fa19e9b9d17f87ead9872355f8c4ede4","plan_hash":"07f046a7031083f6b142e41128ead06e2391a3b63a64566bfc579420de929753","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "kRpTXw==" -> (known after apply)
!~      detect_md5hash      = "jB+vU4xZtSXqFNkXlEOFoQ==" -> "different hash"
!~      generation          = 1752191635207770 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "jB+vU4xZtSXqFNkXlEOFoQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "LrvsSQ==" -> (known after apply)
!~      detect_md5hash      = "2K7c85e1EMDnxtjky8pXvw==" -> "different hash"
!~      generation          = 1752191636882005 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "2K7c85e1EMDnxtjky8pXvw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "OzNfuQ==" -> (known after apply)
!~      detect_md5hash      = "gQDYRjFTdm3tOMNXeu84Og==" -> "different hash"
!~      generation          = 1752010341206630 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "gQDYRjFTdm3tOMNXeu84Og==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #244](https://github.com/cal-itp/data-infra/actions/runs/16209349608)